InformationRegisters/УсловияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>УсловияНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Условия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МодификаторыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>МодификаторыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Модификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МодификаторыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УсловияНоменклатуры/Ext/ManagerModule.bsl
Функция ПолучитьСписокНоменклатуры(Модификатор = Неопределено) Экспорт
	
	Возврат РегистрыСведений.МодификаторыНоменклатуры.ПолучитьСписокНоменклатуры(Модификатор, "УсловияНоменклатуры");	
	
КонецФункции // ПолучитьСписокНоменклатуры()


Процедура ПолучитьПравилаУсловий(Ссылка, Родитель, Объект) Экспорт

	РегистрыСведений.МодификаторыНоменклатуры.ПолучитьПравилаМодификаторов(Ссылка, Родитель, Объект, "УсловияНоменклатуры");
	
КонецПроцедуры // ПолучитьПравилаУсловий()

Процедура УстановитьПравилаУсловий(Ссылка, Родитель, Объект, Отказ) Экспорт

	РегистрыСведений.МодификаторыНоменклатуры.УстановитьПравилаМодификаторов(Ссылка, Родитель, Объект, Отказ, "УсловияНоменклатуры");
	
КонецПроцедуры // УстановитьПравилаУсловий()
